import random


number = ['桃A','桃2','桃3','桃4','桃5','桃6','桃7','桃8','桃9','桃10','桃J','桃Q','桃K',
          '心A','心2','心3','心4','心5','心6','心7','心8','心9','心10','心J','心Q','心K',
          '梅A','梅2','梅3','梅4','梅5','梅6','梅7','梅8','梅9','梅10','梅J','梅Q','梅K',
          '砖A','砖2','砖3','砖4','砖5','砖6','砖7','砖8','砖9','砖10','砖J','砖Q','砖K']

n = 0
while  n < 1000 :

    n+=1
    i = int(random.randint(0,51))
    print('i第',n,'次的值为  ',i)

    j = int(random.randint(0,51))
    print('j第',n,'次的值为  ',j)

    number[i],number[j] = number[j],number[i]





print(number[0:12],'\n',number[13:25],'\n',number[26:38],'\n',number[39:51])
